# IFCExtrusionCalculatorOptions Class

---
This class contains the options used to calculate extrusions from Revit geometry.
SystemObject Autodesk.Revit.DB.IFCIFCExtrusionCalculatorOptions
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCExtrusionCalculatorOptions : IDisposable

    Public Class IFCExtrusionCalculatorOptions
    	Implements IDisposable

    public ref class IFCExtrusionCalculatorOptions : IDisposable

    type IFCExtrusionCalculatorOptions =
        class
            interface IDisposable
        end
The IFCExtrusionCalculatorOptions type exposes the following members.
| Name| Description
---|---|---
| IFCExtrusionCalculatorOptions|  Constructs a new instance of a class used to calculate extrusions from Revit geometry.
Top
| Name| Description
---|---|---
| CustomAxis|  The custom axis to try (if extrusionAxes includes an option for a custom direction).
| ExtrusionAxes|  The extrusion axes to try when doing the calculation.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Scale|  The scaling factor for length measurements from the default Revit units to the export units.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IFCExtrusionCalculatorOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.IFC Namespace